# Python Basics: Data Types and Data Structures - Exercises

## Lists

### Exercise: Basic Properties </br>

Consider the following list:

In [ ]:
mixed_list = [1, 'apple', 2, 'banana', 5, 7]

1. Return the length of the list

2. check if "orange" is in the list, use the "in" expression

3. Print each element in ***mixed_list*** with a for-loop.

4. Replace all strings with a number, use the ***type()*** function in order to determine the datatype
   and compare elements with ***==***. </br>
   Hint: Use ***enumerate()*** in the loop

### Exercise: Creating lists and accessing lists </br>

In this exercise we will go through different ways of creating a list

1. Create two lists one with 10 ascending even and odd numbers respectively. Use list comprehension.

In [ ]:
lst_even =

In [ ]:
lst_odd =

2. Given the list above, say, lst_even. Select every second element of the list.

3. Given the following list. Check how many times x = 2 occurs and return the corresponding index.
Several answers are possible. Check the internet!

In [ ]:
lst = [2, 4, 5, 2, 5, 2, 2, 5, 8, 10]

4. Given the following list, sort the elements in descending order and select all elements below 10. Use the
.sort() method of a list object.

In [ ]:
lst = [2, 44, 5, 2, 5, 42, 2, 33, 1, 10]

### Bonus Exercise (Homework): A challenge </br>

Generate the first 100 prime numbers. Use the Sieve of Eratosthenes.

In [ ]:
lst_not_primes = [j for i in range(2, 8) for j in range(i*2, 100, i)]
lst_primes = [x for x in range(2, 100) if x not in lst_not_primes]

## Dictionaries

### Exercise: Basic Properties </br>

1. Create a dictionary by zipping two lists. Use the dict() constructor and zip() function

In [ ]:
keys = ['apple', 'banana', 'cherry']
values = [1, 2, 5]

dct = ___

2. Update the number of apples to 5 and delete the banana entry from the dictionary

3. Print the keys of the dictionary and return the number of keys in the dictionary

### Exercise: Loops and Iteration </br>

1. Consider the following dictionary.

In [ ]:
dict_fruits = {
    "Apple": 3,
    "Banana": 13,
    "Orange": 2,
    "Grapes": 55,
    "Melons": 3
}

Iterate through ***dict_fruits*** and create a new dictionary that only contains pairs in which the value is
than 5. Use dictionary comprehension.

2. Again, consider the following dictionary.

In [ ]:
dict_bank = {
    "Bank_1": [13, 1, 31, 43, 53],
    "Bank_2": [12, 2],
    "Bank_3": [12, 2, 3, 4, 5],
    "Bank_4": [13, 22, 31, 44, 53],
    "Bank_5": [12, 33]
}

Create a new dictionary with the same keys but with the length of the original list instead.

3. Example: With the same dictionary ***dict_bank***. Return a dictionary that contains only key-list pairs
in which only odd numbers occur. </br>
Hint: Use the built-in all() function.

In [ ]:
{key: val for key, val in dict_bank.items() if all(i % 2 != 0 for i in val)}

4. With the same dictionary ***dict_bank***. Return a dictionary that contains only key-list pairs
in which at least on number is odd. </br>
Hint: Use the built-in any() function.

## Pandas

### Exercise: Create Dataframes, labeling, data selection </br>

1. Given the following dictionary and list of labels, create a pandas dataframe

In [15]:
import pandas as pd
import numpy as np

exam_data  = {'name': ['orange', 'apples', 'grapes', 'ananas', 'banana', 'melon', 'tomato', 'coconut', 'berry', 'Kevin'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'stock': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'tasty': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

      name  score  stock tasty
a   orange   12.5      1   yes
b   apples    9.0      3    no
c   grapes   16.5      2   yes
d   ananas    NaN      3    no
e   banana    9.0      2    no
f    melon   20.0      3   yes
g   tomato   14.5      1   yes
h  coconut    NaN      1    no
i    berry    8.0      2    no
j    Kevin   19.0      1   yes

In [ ]:
df = pd.DataFrame(exam_data , index=labels)

df

2. Based on the dataframe above

- Select the two first rows
- Select the columns 'score' and 'tasty'
- Select the first and last column and display the first and last row
- Change all entries in 'tasty' to 'yes'
- Create a new column named 'weighted stock' which is the 'scores' times 'stock'
- Drop all rows that contain NaN value
- Return a dataframe with scores lower than 10 (the method is also referred to as boolean masking)

     name  score  stock tasty
a  orange   12.5      1   yes
b  apples    9.0      3    no

   score tasty
a   12.5   yes
b    9.0    no
c   16.5   yes
d    NaN    no
e    9.0    no
f   20.0   yes
g   14.5   yes
h    NaN    no
i    8.0    no
j   19.0   yes

      name  score  stock tasty
a   orange   12.5      1   yes
b   apples    9.0      3   yes
c   grapes   16.5      2   yes
d   ananas    NaN      3   yes
e   banana    9.0      2   yes
f    melon   20.0      3   yes
g   tomato   14.5      1   yes
h  coconut    NaN      1   yes
i    berry    8.0      2   yes
j    Kevin   19.0      1   yes

      name  score  stock tasty  weighted stock
a   orange   12.5      1   yes            12.5
b   apples    9.0      3   yes            27.0
c   grapes   16.5      2   yes            33.0
d   ananas    NaN      3   yes             NaN
e   banana    9.0      2   yes            18.0
f    melon   20.0      3   yes            60.0
g   tomato   14.5      1   yes            14.5
h  coconut    NaN      1   yes             NaN
i    berry    8.0      2   yes            16.0
j    Kevin   19.0      1   yes            19.0

     name  score  stock tasty  weighted stock
a  orange   12.5      1   yes            12.5
b  apples    9.0      3   yes            27.0
c  grapes   16.5      2   yes            33.0
e  banana    9.0      2   yes            18.0
f   melon   20.0      3   yes            60.0
g  tomato   14.5      1   yes            14.5
i   berry    8.0      2   yes            16.0
j   Kevin   19.0      1   yes            19.0

     name  score  stock tasty  weighted stock
b  apples    9.0      3   yes            27.0
e  banana    9.0      2   yes            18.0
i   berry    8.0      2   yes            16.0

### Exercise: Concatenating and Merging </br>

Join the two given dataframes along rows and merge with another
dataframe along the common column id.

In [22]:
# from w3 resources:

student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'],
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'],
        'marks': [201, 200, 198, 219, 201]})

exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})

Original DataFrames:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201
   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

Join first two said dataframes along rows:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

Now join the said result_data and df_exam_data along student_id:
  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

### Helpful links:

built-in functions: </br>
https://docs.python.org/3/library/functions.html#any

dictionary comprehension with conditions: </br>
https://thispointer.com/python-filter-a-dictionary-by-conditions-on-keys-or-values/

A lot of exercises: </br>
https://www.w3resource.com/python-exercises/dictionary/

One python classic with a lot of beautiful notebooks, very helpful
https://jakevdp.github.io/PythonDataScienceHandbook/